### **Missing Value Analysis**

**Import Packages**

In [37]:
# Create a Dataframe having some mising values
import numpy as np
import pandas as pd

In [38]:
dict1= {'Names':['Tarun','Ashish','Suri',None],
       'Age':[30,31,np.nan,32],
       'City':[None,'Hyd','Pune','Blr']}

df1=pd.DataFrame(dict1)
df1

    Names   Age  City
0   Tarun  30.0  None
1  Ashish  31.0   Hyd
2    Suri   NaN  Pune
3    None  32.0   Blr

In [2]:
df1.dtypes

Names     object
Age      float64
City      object
dtype: object

- np.nan ====> None

In [6]:
dict2= {'Names':['Tarun', 'Ashish','Suri',None],
       'Age':[30,31,None,32],                       # Here, in place of np.nan, we provided None
       'City':[None,'Hyd','Pune','Blr']}

df2=pd.DataFrame(dict2)
df2

    Names   Age  City
0   Tarun  30.0  None
1  Ashish  31.0   Hyd
2    Suri   NaN  Pune
3    None  32.0   Blr

In [7]:
df2.dtypes

Names     object
Age      float64
City      object
dtype: object

In [8]:
dict3= {'Names':['Tarun', 'Ashish','Suri',None],
       'Age':[30,31,None,'32'],                        # Here, in place of 32, we provided '32'
       'City':[None,'Hyd','Pune','Blr']}

df3=pd.DataFrame(dict3)
df3

    Names   Age  City
0   Tarun    30  None
1  Ashish    31   Hyd
2    Suri  None  Pune
3    None    32   Blr

In [9]:
df3.dtypes

Names    object
Age      object
City     object
dtype: object

In [8]:
# Here, we will get error because 'Age' column has 1 missing value
# So, it won't be able to convert string to int
# Generally, it is possible to convert '32' to 32 when we dont have any missing values

df3['Age']=df3['Age'].astype('int')

TypeError: int() argument must be a string, a bytes-like object or a real number, not 'NoneType'

In [10]:
int('32')

32

In [11]:
dict4= {'Names':['Tarun', 'Ashish','Suri',None],
       'Age':[30,31,'33','32'],
       'City':[None,'Hyd','Pune','Blr']}

df4=pd.DataFrame(dict4)
df4

    Names Age  City
0   Tarun  30  None
1  Ashish  31   Hyd
2    Suri  33  Pune
3    None  32   Blr

In [12]:
df4.dtypes

Names    object
Age      object
City     object
dtype: object

In [13]:
# Now, we can easily convert it to int because the column has no missing values

df4['Age']=df4['Age'].astype('int')

In [14]:
df4.dtypes

Names    object
Age       int32
City     object
dtype: object

- If you want to change the data type of a column, use astype

- But if a column has missing values astype will fail

In [16]:
# Second type error here

dict5= {'Names':['Tarun', 'Ashish','Suri',None],
       'Age':[30,31,np.nan,'32'],
       'City':[None,'Hyd','Pune','Blr']}

df5=pd.DataFrame(dict5)
df5['Age']=df5['Age'].astype('int')

ValueError: cannot convert float NaN to integer

In [ ]:
# df5: ValueError: cannot convert float NaN to integer: missing value np.nan === int or float
# df3: TypeError: int() argument must be a string, a bytes-like object or a real number, not 'NoneType'
       # None === str  int   float

# NonType :   represent as None

# 'a'+'b' : concatenation
# 'a'*'b' : diff1
# 'a'-'b' : diff2
# 'a'/'b' : diff2

- np.nan represents only Number, that number can be an int or can be a float

- None represents string, bytes, float and int

**Method-1**

In [19]:
dict1= {'Names':['Tarun', 'Ashish','Suri',None],
       'Age':[30,31,np.nan,'32'],
       'City':[None,'Hyd','Pune','Blr']}

df1=pd.DataFrame(dict1)
df1

    Names  Age  City
0   Tarun   30  None
1  Ashish   31   Hyd
2    Suri  NaN  Pune
3    None   32   Blr

In [20]:
df1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [21]:
df1.isna()

   Names    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [22]:
df1.isnull().sum()
# It will give column wise total(sum) mising values

Names    1
Age      1
City     1
dtype: int64

In [25]:
# The total values in first column are :4
# In that 1 value is missed
# so what could be the percentage: 1/4=25%
df1.isnull().sum()/len(df1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

**fillna**

In [26]:
df1.fillna(20)

    Names Age  City
0   Tarun  30    20
1  Ashish  31   Hyd
2    Suri  20  Pune
3      20  32   Blr

In [27]:
df1['Names'].fillna('Aymen')

0     Tarun
1    Ashish
2      Suri
3     Aymen
Name: Names, dtype: object

In [28]:
df1['City'].fillna('Chennai')

# untill we save we can not see updated dataframe

0    Chennai
1        Hyd
2       Pune
3        Blr
Name: City, dtype: object

In [29]:
df1

    Names  Age  City
0   Tarun   30  None
1  Ashish   31   Hyd
2    Suri  NaN  Pune
3    None   32   Blr

**Method-2**

- we have some methods 

    - bfill

    - ffill

    - backfill

    - pad

In [26]:
df1.fillna(method='bfill')

C:\Users\thaku\AppData\Local\Temp\ipykernel_14552\2949398996.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1.fillna(method='bfill')

    Names   Age  City
0   Tarun  30.0   Hyd
1  Ashish  31.0   Hyd
2    Suri  32.0  Pune
3    None  32.0   Blr

- bfill means before fill 

- It will fill with Next value

In [33]:
import warnings
warnings.filterwarnings('ignore')
df1.fillna(method='bfill')

    Names Age  City
0   Tarun  30   Hyd
1  Ashish  31   Hyd
2    Suri  32  Pune
3    None  32   Blr

In [34]:
df1.fillna(method='ffill')  # It will fill with previous upper value

    Names Age  City
0   Tarun  30  None
1  Ashish  31   Hyd
2    Suri  31  Pune
3    Suri  32   Blr

In [35]:
df1.fillna(method='backfill')

    Names Age  City
0   Tarun  30   Hyd
1  Ashish  31   Hyd
2    Suri  32  Pune
3    None  32   Blr

In [36]:
df1.fillna(method='pad')

    Names Age  City
0   Tarun  30  None
1  Ashish  31   Hyd
2    Suri  31  Pune
3    Suri  32   Blr

- backfill=bfill

- ffill= pad

- One more argument is there axis

- By default axis=0 

- Give axis=1 and reapeat bfill ffill

In [27]:
df1.fillna(method='ffill',axis=1)

C:\Users\thaku\AppData\Local\Temp\ipykernel_14552\209249745.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1.fillna(method='ffill',axis=1)

    Names   Age  City
0   Tarun  30.0  30.0
1  Ashish  31.0   Hyd
2    Suri  Suri  Pune
3    None  32.0   Blr

In [28]:
df1.fillna(method='bfill',axis=1)

C:\Users\thaku\AppData\Local\Temp\ipykernel_14552\2900121331.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1.fillna(method='bfill',axis=1)

    Names   Age  City
0   Tarun  30.0  None
1  Ashish  31.0   Hyd
2    Suri  Pune  Pune
3    32.0  32.0   Blr

**Method-3**

- Mean

- Medain

- Mode

In [29]:
dict1= {'Names':['Tarun', 'Ashish','Suri',None],
       'Age':[30,31,np.nan,32],
       'City':[None,'Hyd','Pune','Blr']}

df1=pd.DataFrame(dict1)
df1

    Names   Age  City
0   Tarun  30.0  None
1  Ashish  31.0   Hyd
2    Suri   NaN  Pune
3    None  32.0   Blr

In [30]:
mean_age=df1['Age'].mean()

In [31]:
df1['Age'] = df1['Age'].fillna(mean_age)

In [32]:
df1

    Names   Age  City
0   Tarun  30.0  None
1  Ashish  31.0   Hyd
2    Suri  31.0  Pune
3    None  32.0   Blr

**KNN imputer**

- KNN means: K Nearest Neighbours

- Where K is a Number 

- Instead of taking all the numbers average

- It consider k neigbours

- How can we know about the Neigbours`

- Based on Distanace metric we will calculate the distances

- User will decide how many neighbours need to choose

- k = hyper parameters

- if k=5 means , It will take top 5 negighbours, which means

- those 5 observations has less distance

- will calculate average of those observations values

- Applicable only for Numerical data

<img id="dimg_11" src="" class="YQ4gaf" height="203" style="object-position:41% 16%" width="248" alt="Distance Measures in Machine Learning ..." data-csiid="26" data-atf="1">

- Package name: Sklearn

    - Class name: Impute

        - Method name: KNNImputer

In [33]:
dict1= {'Names':['Tarun', 'Ashish','Suri',None],
       'Age':[30,31,np.nan,32],
       'City':[None,'Hyd','Pune','Blr']}

df1=pd.DataFrame(dict1)
df1

    Names   Age  City
0   Tarun  30.0  None
1  Ashish  31.0   Hyd
2    Suri   NaN  Pune
3    None  32.0   Blr

In [35]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
df1['Age'] = KI.fit_transform(df1[['Age']])

In [36]:
df1

    Names   Age  City
0   Tarun  30.0  None
1  Ashish  31.0   Hyd
2    Suri  31.0  Pune
3    None  32.0   Blr